# 源代码===》翻译===》机器语言

# 计算机语言具有高级语言和低级语言之分。而高级语言又主要是相对于汇编语言而言的，它是较接近自然语言和数学
# 公式的编程，基本脱离了机器的硬件系统，用人们更易理解的方式编写程序，编写的程序称之为源程序。


# 低级语言：汇编语言和机器语言
# 机器语言：二进制代码构成，计算机可直接执行的指令（如1011000001100001）
# 汇编语言：使用助记符（如ADD,MOV)代替机器指令，需通过汇编程序转换为机器码。
# 高级语言：并不是特指某一种具体的语言，而是包括很多编程语言，如流行的java，c，c++。c#，python等。

# 高级语言解释：
"""
为了更高效的使用计算机，人们设计出了高级编程语言，来满足人们对于高效简的编程语言的追求。用高级编程语言编写的程序需
要经过翻译，翻译成机器所能识别的二进制数才能由计算机去执行。
高级编程语言，因为它距离计算机硬件比较远，作为用户层面的编程工具，用户并不需要去了解硬件的结构，而是用逻辑的语言去
实现想要的目标。对于开发者来说不需要考虑硬件的一些细节，开发的效率就能得一个极大的提升。
高级语言更接近人类的语言，方便人们进行程序的设计和开发。
"""

# 高级语言设计的程序必须要经过“翻译”以后才能被机器执行。“翻译”的方法有两种，一种是解释，一种是编译。
# 编译型语言：
# 源代码==》一次性编译==》可执行文件
#c c++

#解释型语言：
#解释器将源代码转换为机器执行命令
#一边翻译一边执行
#python


#pycharm：写代码的地方
#python解释器：是计算机的一个程序，用于解释python代码，并提交给计算机执行。

